index.org
#+title: CAS CS 392
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="myStyle.css" />
#+OPTIONS: html-style:nil H:2 toc:1 num:nil
#+HTML_LINK_HOME: http://nmmull.github.io
| Rust, in Practice and in Theory |
| Boston University               |
| Fall 2025                       |
This is a course about the programming language Rust, and, for better
or for worse, this can mean a lot of things.  Part of what making Rust
fascinating (and what makes this course a pain to teach) is that it has a
lot to offer.  You might be coming to this course with an interest in
systems programming (an unreasonbly broad term), or PL design (ditto).
Regardless, our goal is not just to program in Rust, but also to
understand the theoretical underpinnings of the language. So in
reality you'll probably need to have at least a passing interest in
both perspectives.

We'll spend the first half of this course learning how to program in
Rust, and the second half working on a self-defined project in Rust or
an adjacent topics.

* Links
+ [[file:Syllabus/main.pdf][Course Manual]]
+ [[https://piazza.com/class/mex7r1jygw53ka/][Piazza]]
+ [[https://www.gradescope.com/courses/1109910][Gradescope]]
+ Reading:
  + [[https://doc.rust-lang.org/stable/book/][The Rust Programming Language]]
  + [[https://doc.rust-lang.org/stable/rust-by-example/index.html][Rust by Example]]
  + [[https://doc.rust-lang.org/nomicon/intro.html][Rustonomicon]]
  + [[https://rust-unofficial.github.io/too-many-lists/index.html][Learning Rust With Entirely Too Many Linked Lists]]
  + [[https://doc.rust-lang.org/reference/][The Rust Reference]]
  + [[https://homepages.inf.ed.ac.uk/wadler/papers/lineartaste/lineartaste-revised.pdf][A taste of linear logic]]
  + [[https://dl.acm.org/doi/10.1145/3443420][A Lightweight Formalism for Reference Lifetimes and Borrowing in Rust]]
+ Other Resources:
  + [[https://doc.rust-lang.org/std/index.html][Rust Standard Library]]
  + [[https://github.com/rustviz/rustviz][RustViz]]
* Calendar
|-------+---------------------------------------------+-------------------------|
| Date  | Topic                                       | Notes                   |
|-------+---------------------------------------------+-------------------------|
| [[*Meeting 1][09-02]] | Basics I: Introduction, Installation, Cargo |                         |
| [[*Meeting 2][09-04]] | Basics II: Common Programming Concepts      | A1 out                  |
|-------+---------------------------------------------+-------------------------|
| [[*Meeting 3][09-09]] | Data I: Stack, Heap, References             |                         |
| [[*Meeting 4][09-11]] | Data II: Struct, Enums, Collections         | A2 out, A1 due          |
|-------+---------------------------------------------+-------------------------|
| [[*Meeting 5][09-16]] | Theory I: PL Theory Primer                  |                         |
| [[*Meeting 6][09-18]] | Theory II: References and Boxes             | A3 out, A2 due          |
|-------+---------------------------------------------+-------------------------|
| [[*Meeting 7][09-23]] | Functions I: Generics and Traits            |                         |
| [[*Meeting 8][09-25]] | Functions II: Closures and Iterators        | A4 out, A3 due          |
|-------+---------------------------------------------+-------------------------|
| [[*Meeting 9][09-30]] | Smart Pointers I: Boxes, Recursive Data     |                         |
| [[*Meeting 10][10-02]] | Smart Pointers II: ~Rc<T>~ and ~RefCell<T>~ | A5 out, A4 due          |
|-------+---------------------------------------------+-------------------------|
| [[*Meeting 11][10-07]] | Theory III: Blocks and Lifetimes            |                         |
| [[*Meeting 12][10-09]] | Theory IV: Tuples and Paths                 | A6 out, A5 due          |
|-------+---------------------------------------------+-------------------------|
| 10-14 | *NO CLASS*                                  | Indigenous Peoples' Day |
| [[*Meeting 13][10-16]] | Concurrency I: Message Passing              | A6 due                  |
|-------+---------------------------------------------+-------------------------|
| [[*Meeting 14][10-21]] | Concurrency II: Asynchronous Programming    |                         |
| [[*Meeting 15][10-23]] | *Midterm Exam*                              | A7 out                  |
|-------+---------------------------------------------+-------------------------|
| [[*Meeting 16][10-28]] | Theory V: Conditionals                      |                         |
| [[*Meeting 17][10-30]] | Theory VI: Linear Typed Lambda Calculus     | FP outline out, A7 due  |
|-------+---------------------------------------------+-------------------------|
| [[*Meeting 18][11-04]] | Advanced I: TBD                             |                         |
| [[*Meeting 19][11-06]] | Project Meetings                            | FP outline due          |
|-------+---------------------------------------------+-------------------------|
| [[*Meeting 20][11-11]] | Advanced II: TBD                            |                         |
| [[*Meeting 21][11-13]] | Project Meetings                            | FP check-in 1           |
|-------+---------------------------------------------+-------------------------|
| [[*Meeting 22][11-18]] | Advanced III: TBD                           |                         |
| [[*Meeting 23][11-20]] | Project Meetings                            | FP check-in 2           |
|-------+---------------------------------------------+-------------------------|
| [[*Meeting 24][11-25]] | Advanced IV: TBD                            |                         |
| 11-27 | *NO CLASS*                                  | Thanksgiving            |
|-------+---------------------------------------------+-------------------------|
| [[*Meeting 25][12-02]] | Advance V: TBD                              |                         |
| [[*Meeting 26][12-04]] | Final Project Presentations                 |                         |
|-------+---------------------------------------------+-------------------------|
| [[*Meeting 27][12-09]] | Final Project Presentations                 | FP due                  |
|-------+---------------------------------------------+-------------------------|
* Week 1: Basics
** Meeting 1
