index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-09-01 Mon 18:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>CAS CS 392</title>
<meta name="author" content="Nathan" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="myStyle.css" />
</head>
<body>
<div id="org-div-home-and-up"><a href="http://nmmull.github.io">↩</a></div><div id="content" class="content">
<h1 class="title">CAS CS 392</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org415823d">Links</a></li>
<li><a href="#org53d81c6">Calendar</a></li>
<li><a href="#org2945853">Week 1: Basics</a></li>
<li><a href="#org99a0b33">Week 2: Data</a></li>
<li><a href="#org39af471">Week 3: Theory</a></li>
<li><a href="#org3187cbb">Week 4: Functions</a></li>
<li><a href="#org9b3e7a3">Week 5: Smart Pointers</a></li>
<li><a href="#org2bb5b8e">Week 6: Theory</a></li>
<li><a href="#org30ef1ab">Week 7: Concurrency</a></li>
<li><a href="#org85ff0de">Week 8: Midterm</a></li>
<li><a href="#org59f8112">Week 9: Theory</a></li>
<li><a href="#org4e4521c">Week 10: TBD</a></li>
<li><a href="#org502d9d2">Week 11: TBD</a></li>
<li><a href="#org3a8a705">Week 12: TBD</a></li>
<li><a href="#org02f5124">Week 13: TBD</a></li>
<li><a href="#orge56dcc6">Week 14: Final Project</a></li>
<li><a href="#org3a7620f">Week 15: Final Project</a></li>
</ul>
</div>
</div>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Rust, in Practice and in Theory</td>
</tr>

<tr>
<td class="org-left">Boston University</td>
</tr>

<tr>
<td class="org-left">Fall 2025</td>
</tr>
</tbody>
</table>
<p>
This is a course about the programming language Rust, and, for better
or for worse, this can mean a lot of things.  Part of what making Rust
fascinating (and what makes this course a pain to teach) is that it has a
lot to offer.  You might be coming to this course with an interest in
systems programming (an unreasonbly broad term), or PL design (ditto).
Regardless, our goal is not just to program in Rust, but also to
understand the theoretical underpinnings of the language. So in
reality you'll probably need to have at least a passing interest in
both perspectives.
</p>

<p>
We'll spend the first half of this course learning how to program in
Rust, and the second half working on a self-defined project in Rust or
an adjacent topics.
</p>
<div id="outline-container-org415823d" class="outline-2">
<h2 id="org415823d">Links</h2>
<div class="outline-text-2" id="text-org415823d">
<ul class="org-ul">
<li><a href="Syllabus/main.pdf">Course Manual</a></li>
<li><a href="https://piazza.com/class/mex7r1jygw53ka/">Piazza</a></li>
<li><a href="https://www.gradescope.com/courses/1109910">Gradescope</a></li>
<li>Reading:
<ul class="org-ul">
<li><a href="https://doc.rust-lang.org/stable/book/">The Rust Programming Language</a></li>
<li><a href="https://doc.rust-lang.org/stable/rust-by-example/index.html">Rust by Example</a></li>
<li><a href="https://doc.rust-lang.org/nomicon/intro.html">Rustonomicon</a></li>
<li><a href="https://rust-unofficial.github.io/too-many-lists/index.html">Learning Rust With Entirely Too Many Linked Lists</a></li>
<li><a href="https://doc.rust-lang.org/reference/">The Rust Reference</a></li>
<li><a href="https://homepages.inf.ed.ac.uk/wadler/papers/lineartaste/lineartaste-revised.pdf">A taste of linear logic</a></li>
<li><a href="https://dl.acm.org/doi/10.1145/3443420">A Lightweight Formalism for Reference Lifetimes and Borrowing in Rust</a></li>
</ul></li>
<li>Other Resources:
<ul class="org-ul">
<li><a href="https://doc.rust-lang.org/std/index.html">Rust Standard Library</a></li>
<li><a href="https://github.com/rustviz/rustviz">RustViz</a></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org53d81c6" class="outline-2">
<h2 id="org53d81c6">Calendar</h2>
<div class="outline-text-2" id="text-org53d81c6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Date</th>
<th scope="col" class="org-left">Topic</th>
<th scope="col" class="org-left">Notes</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><a href="#orge827750">09-02</a></td>
<td class="org-left">Basics I: Introduction, Installation, Cargo</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><a href="#org58d9a92">09-04</a></td>
<td class="org-left">Basics II: Common Programming Concepts</td>
<td class="org-left">A1 out</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><a href="#orgc4adf15">09-09</a></td>
<td class="org-left">Data I: Stack, Heap, References</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><a href="#org8480ede">09-11</a></td>
<td class="org-left">Data II: Struct, Enums, Collections</td>
<td class="org-left">A2 out, A1 due</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><a href="#orge80c913">09-16</a></td>
<td class="org-left">Theory I: PL Theory Primer</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><a href="#org0c6daa4">09-18</a></td>
<td class="org-left">Theory II: References and Boxes</td>
<td class="org-left">A3 out, A2 due</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><a href="#orge268270">09-23</a></td>
<td class="org-left">Functions I: Generics and Traits</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><a href="#org5d971f3">09-25</a></td>
<td class="org-left">Functions II: Closures and Iterators</td>
<td class="org-left">A4 out, A3 due</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><a href="#orgdfe4035">09-30</a></td>
<td class="org-left">Smart Pointers I: Boxes, Recursive Data</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><a href="#org101dff9">10-02</a></td>
<td class="org-left">Smart Pointers II: <code>Rc&lt;T&gt;</code> and <code>RefCell&lt;T&gt;</code></td>
<td class="org-left">A5 out, A4 due</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><a href="#org3a4a560">10-07</a></td>
<td class="org-left">Theory III: Blocks and Lifetimes</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><a href="#org355b881">10-09</a></td>
<td class="org-left">Theory IV: Tuples and Paths</td>
<td class="org-left">A6 out, A5 due</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">10-14</td>
<td class="org-left"><b>NO CLASS</b></td>
<td class="org-left">Indigenous Peoples' Day</td>
</tr>

<tr>
<td class="org-left"><a href="#orgeb9cfec">10-16</a></td>
<td class="org-left">Concurrency I: Message Passing</td>
<td class="org-left">A6 due</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><a href="#org2db1dd8">10-21</a></td>
<td class="org-left">Concurrency II: Asynchronous Programming</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><a href="#orgaa12159">10-23</a></td>
<td class="org-left"><b>Midterm Exam</b></td>
<td class="org-left">A7 out</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><a href="#orgf46c322">10-28</a></td>
<td class="org-left">Theory V: Conditionals</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><a href="#org8acd6f7">10-30</a></td>
<td class="org-left">Theory VI: Linear Typed Lambda Calculus</td>
<td class="org-left">FP outline out, A7 due</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><a href="#org5e3f16e">11-04</a></td>
<td class="org-left">Advanced I: TBD</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><a href="#org782fe5c">11-06</a></td>
<td class="org-left">Project Meetings</td>
<td class="org-left">FP outline due</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><a href="#org0616994">11-11</a></td>
<td class="org-left">Advanced II: TBD</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><a href="#orgcfeed69">11-13</a></td>
<td class="org-left">Project Meetings</td>
<td class="org-left">FP check-in 1</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><a href="#orgbb6df26">11-18</a></td>
<td class="org-left">Advanced III: TBD</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><a href="#orgf505931">11-20</a></td>
<td class="org-left">Project Meetings</td>
<td class="org-left">FP check-in 2</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><a href="#org580cf5e">11-25</a></td>
<td class="org-left">Advanced IV: TBD</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">11-27</td>
<td class="org-left"><b>NO CLASS</b></td>
<td class="org-left">Thanksgiving</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><a href="#org61aaa6c">12-02</a></td>
<td class="org-left">Advance V: TBD</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><a href="#orgf09bc4a">12-04</a></td>
<td class="org-left">Final Project Presentations</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><a href="#orgae5d31b">12-09</a></td>
<td class="org-left">Final Project Presentations</td>
<td class="org-left">FP due</td>
</tr>
</tbody>
</table>
</div>
</div>
