index.org
*** Title: *Course Introduction*
*** Reading:
+ Syllabus
+ The Rust Programming Language (RPL): [[https://doc.rust-lang.org/book/foreword.html][Forward]]
+ RPL: [[https://doc.rust-lang.org/book/ch00-00-introduction.html][Introduction]]
+ RPL 1: [[https://doc.rust-lang.org/book/ch01-00-getting-started.html][Getting Started]]
** Meeting 2
*** Title: *Common Programming Concepts*
*** Reading:
+ RPL 2: [[https://doc.rust-lang.org/book/ch02-00-guessing-game-tutorial.html][Programming a Guessing Game]]
+ RPL 3: [[https://doc.rust-lang.org/book/ch03-00-common-programming-concepts.html][Common Programming Concepts]]
* Week 2: Data
** Meeting 3
*** Title: *Stack, Heap, References*
*** Reading:
+ RPL 4.2: [[https://doc.rust-lang.org/book/ch04-02-references-and-borrowing.html][References and Borrowing]]
+ RPL 4.1: [[https://doc.rust-lang.org/book/ch04-01-what-is-ownership.html][What is Ownership?]]
** Meeting 4
*** Title: *Structures, Enumerations, Collections*
*** Reading:
+ RPL 5: [[https://doc.rust-lang.org/book/ch05-00-structs.html][Using Structs to Structure Related Data]]
+ PRL 6: [[https://doc.rust-lang.org/book/ch06-00-enums.html][Enums and Pattern Matching]]
+ RPL 18: [[https://doc.rust-lang.org/book/ch18-00-patterns.html][Patterns and Matching]]
+ RPL 4.3: [[https://doc.rust-lang.org/book/ch04-03-slices.html][The Slice Type]]
+ RPL 8: [[https://doc.rust-lang.org/book/ch08-00-common-collections.html][Common Collections]]
* Week 3: Theory
** Meeting 5
*** Title: *PL Theory Primer*
** Meeting 6
*** Title: *References and Boxes*
+ RPL 15.1: [[https://doc.rust-lang.org/stable/book/ch15-01-box.html][Using ~Box<T>~ to Point to Data on the Heap]]
* Week 4: Functions
** Meeting 7
*** Title: *Generics and Traits*
*** Reading:
+ RPL 10.1: [[https://doc.rust-lang.org/book/ch10-01-syntax.html][Generic Data Types]]
+ RPL 10.2: [[https://doc.rust-lang.org/book/ch10-02-traits.html][Traits: Defining Shared Behavior]]
** Meeting 8
*** Title: *Closures and Iterators*
*** Reading:
+ RPL 13: [[https://doc.rust-lang.org/book/ch13-00-functional-features.html][Functional Language Features: Iterators and Closures]]
* Week 5: Smart Pointers
** Meeting 9
*** Title: *Boxes and Recursive Data*
+ RPL 15.1: [[https://doc.rust-lang.org/stable/book/ch15-01-box.html][Using ~Box<T>~ to Point to Data on the Heap]]
+ RPL 15.2: [[https://doc.rust-lang.org/stable/book/ch15-02-deref.html][Treating Smart Pointers Like Regular References with ~Deref~]]
+ RPL 15.3: [[https://doc.rust-lang.org/stable/book/ch15-03-drop.html][Running Code on Cleanup with the ~Drop~ Trait]]
** Meeting 10
*** Title: *Reference Counting and Internal Mutability*
*** Reading:
+ RPL 15.4: [[https://doc.rust-lang.org/stable/book/ch15-04-rc.html][~Rc<T>~, the Reference Counted Smart Pointer]]
+ RPL 15.5: [[https://doc.rust-lang.org/stable/book/ch15-05-interior-mutability.html][~RefCell<T>~ and the Interior Mutability Pattern]]
+ RPL 15.6: [[https://doc.rust-lang.org/stable/book/ch15-06-reference-cycles.html][Reference Cycles Can Leak Memory]]
* Week 6: Theory
** Meeting 11
*** Title: *Blocks and Lifetimes*
*** Reading:
+ RPL 10.3: [[https://doc.rust-lang.org/book/ch10-03-lifetime-syntax.html][Validating References with Lifetimes]]
+ Rustonomicon:
  + 3.2: [[https://doc.rust-lang.org/nomicon/aliasing.html][Aliasing]]
  + 3.3: [[https://doc.rust-lang.org/nomicon/lifetimes.html][Lifetimes]]
  + 3.4: [[https://doc.rust-lang.org/nomicon/lifetime-mismatch.html][Limits of Lifetimes]]
  + 3.5: [[https://doc.rust-lang.org/nomicon/lifetime-elision.html][Lifetime Elision]]
** Meeting 12
*** Title: *Tuples and Paths*
* Week 7: Concurrency
** Meeting 13
*** Title: *Message Passing*
* Week 8: Midterm
** Meeting 14
*** Title: *Asynchronous Programming*
** Meeting 15
*** Title: *Midterm Examination*
* Week 9: Theory
** Meeting 16
*** Title: *Conditionals*
** Meeting 17
*** Title: *Linear Typed Lambda Calculus*
* Week 10: TBD
** Meeting 18
*** Title: *TBD*
** Meeting 19
*** Title: *Project Meetings*
* Week 11: TBD
** Meeting 20
*** Title: *TBD*
** Meeting 21
*** Title: *Project Meetings*
* Week 12: TBD
** Meeting 22
*** Title: *TBD*
** Meeting 23
*** Title: *Project Meetings*
* Week 13: TBD
** Meeting 24
*** Title: *TBD*
