index.html
<div id="outline-container-org2945853" class="outline-2">
<h2 id="org2945853">Week 1: Basics</h2>
<div class="outline-text-2" id="text-org2945853">
</div>
<div id="outline-container-orge827750" class="outline-3">
<h3 id="orge827750">Meeting 1</h3>
<div class="outline-text-3" id="text-orge827750">
</div>
<ul class="org-ul">
<li><a id="orgf82e19e"></a>Title: <b>Course Introduction</b><br /></li>
<li><a id="org585ec23"></a>Reading:<br />
<div class="outline-text-4" id="text-org585ec23">
<ul class="org-ul">
<li>Syllabus</li>
<li>The Rust Programming Language (RPL): <a href="https://doc.rust-lang.org/book/foreword.html">Forward</a></li>
<li>RPL: <a href="https://doc.rust-lang.org/book/ch00-00-introduction.html">Introduction</a></li>
<li>RPL 1: <a href="https://doc.rust-lang.org/book/ch01-00-getting-started.html">Getting Started</a></li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-org58d9a92" class="outline-3">
<h3 id="org58d9a92">Meeting 2</h3>
<div class="outline-text-3" id="text-org58d9a92">
</div>
<ul class="org-ul">
<li><a id="org66cef78"></a>Title: <b>Common Programming Concepts</b><br /></li>
<li><a id="orgc46921b"></a>Reading:<br />
<div class="outline-text-4" id="text-orgc46921b">
<ul class="org-ul">
<li>RPL 2: <a href="https://doc.rust-lang.org/book/ch02-00-guessing-game-tutorial.html">Programming a Guessing Game</a></li>
<li>RPL 3: <a href="https://doc.rust-lang.org/book/ch03-00-common-programming-concepts.html">Common Programming Concepts</a></li>
</ul>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-org99a0b33" class="outline-2">
<h2 id="org99a0b33">Week 2: Data</h2>
<div class="outline-text-2" id="text-org99a0b33">
</div>
<div id="outline-container-orgc4adf15" class="outline-3">
<h3 id="orgc4adf15">Meeting 3</h3>
<div class="outline-text-3" id="text-orgc4adf15">
</div>
<ul class="org-ul">
<li><a id="org74120f9"></a>Title: <b>Stack, Heap, References</b><br /></li>
<li><a id="org4cbf393"></a>Reading:<br />
<div class="outline-text-4" id="text-org4cbf393">
<ul class="org-ul">
<li>RPL 4.2: <a href="https://doc.rust-lang.org/book/ch04-02-references-and-borrowing.html">References and Borrowing</a></li>
<li>RPL 4.1: <a href="https://doc.rust-lang.org/book/ch04-01-what-is-ownership.html">What is Ownership?</a></li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-org8480ede" class="outline-3">
<h3 id="org8480ede">Meeting 4</h3>
<div class="outline-text-3" id="text-org8480ede">
</div>
<ul class="org-ul">
<li><a id="orga32458a"></a>Title: <b>Structures, Enumerations, Collections</b><br /></li>
<li><a id="orgac858db"></a>Reading:<br />
<div class="outline-text-4" id="text-orgac858db">
<ul class="org-ul">
<li>RPL 5: <a href="https://doc.rust-lang.org/book/ch05-00-structs.html">Using Structs to Structure Related Data</a></li>
<li>PRL 6: <a href="https://doc.rust-lang.org/book/ch06-00-enums.html">Enums and Pattern Matching</a></li>
<li>RPL 18: <a href="https://doc.rust-lang.org/book/ch18-00-patterns.html">Patterns and Matching</a></li>
<li>RPL 4.3: <a href="https://doc.rust-lang.org/book/ch04-03-slices.html">The Slice Type</a></li>
<li>RPL 8: <a href="https://doc.rust-lang.org/book/ch08-00-common-collections.html">Common Collections</a></li>
</ul>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-org39af471" class="outline-2">
<h2 id="org39af471">Week 3: Theory</h2>
<div class="outline-text-2" id="text-org39af471">
</div>
<div id="outline-container-orge80c913" class="outline-3">
<h3 id="orge80c913">Meeting 5</h3>
<div class="outline-text-3" id="text-orge80c913">
</div>
<ul class="org-ul">
<li><a id="org36dc604"></a>Title: <b>PL Theory Primer</b><br /></li>
</ul>
</div>
<div id="outline-container-org0c6daa4" class="outline-3">
<h3 id="org0c6daa4">Meeting 6</h3>
<div class="outline-text-3" id="text-org0c6daa4">
</div>
<ul class="org-ul">
<li><a id="org3829bfb"></a>Title: <b>References and Boxes</b><br />
<div class="outline-text-4" id="text-org3829bfb">
<ul class="org-ul">
<li>RPL 15.1: <a href="https://doc.rust-lang.org/stable/book/ch15-01-box.html">Using <code>Box&lt;T&gt;</code> to Point to Data on the Heap</a></li>
</ul>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-org3187cbb" class="outline-2">
<h2 id="org3187cbb">Week 4: Functions</h2>
<div class="outline-text-2" id="text-org3187cbb">
</div>
<div id="outline-container-orge268270" class="outline-3">
<h3 id="orge268270">Meeting 7</h3>
<div class="outline-text-3" id="text-orge268270">
</div>
<ul class="org-ul">
<li><a id="orga17b2b7"></a>Title: <b>Generics and Traits</b><br /></li>
<li><a id="org2a518e8"></a>Reading:<br />
<div class="outline-text-4" id="text-org2a518e8">
<ul class="org-ul">
<li>RPL 10.1: <a href="https://doc.rust-lang.org/book/ch10-01-syntax.html">Generic Data Types</a></li>
<li>RPL 10.2: <a href="https://doc.rust-lang.org/book/ch10-02-traits.html">Traits: Defining Shared Behavior</a></li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-org5d971f3" class="outline-3">
<h3 id="org5d971f3">Meeting 8</h3>
<div class="outline-text-3" id="text-org5d971f3">
</div>
<ul class="org-ul">
<li><a id="org3b4d3af"></a>Title: <b>Closures and Iterators</b><br /></li>
<li><a id="org2b7af82"></a>Reading:<br />
<div class="outline-text-4" id="text-org2b7af82">
<ul class="org-ul">
<li>RPL 13: <a href="https://doc.rust-lang.org/book/ch13-00-functional-features.html">Functional Language Features: Iterators and Closures</a></li>
</ul>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-org9b3e7a3" class="outline-2">
<h2 id="org9b3e7a3">Week 5: Smart Pointers</h2>
<div class="outline-text-2" id="text-org9b3e7a3">
</div>
<div id="outline-container-orgdfe4035" class="outline-3">
<h3 id="orgdfe4035">Meeting 9</h3>
<div class="outline-text-3" id="text-orgdfe4035">
</div>
<ul class="org-ul">
<li><a id="org7341815"></a>Title: <b>Boxes and Recursive Data</b><br />
<div class="outline-text-4" id="text-org7341815">
<ul class="org-ul">
<li>RPL 15.1: <a href="https://doc.rust-lang.org/stable/book/ch15-01-box.html">Using <code>Box&lt;T&gt;</code> to Point to Data on the Heap</a></li>
<li>RPL 15.2: <a href="https://doc.rust-lang.org/stable/book/ch15-02-deref.html">Treating Smart Pointers Like Regular References with <code>Deref</code></a></li>
<li>RPL 15.3: <a href="https://doc.rust-lang.org/stable/book/ch15-03-drop.html">Running Code on Cleanup with the <code>Drop</code> Trait</a></li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-org101dff9" class="outline-3">
<h3 id="org101dff9">Meeting 10</h3>
<div class="outline-text-3" id="text-org101dff9">
</div>
<ul class="org-ul">
<li><a id="org5089845"></a>Title: <b>Reference Counting and Internal Mutability</b><br /></li>
<li><a id="orgd74301a"></a>Reading:<br />
<div class="outline-text-4" id="text-orgd74301a">
<ul class="org-ul">
<li>RPL 15.4: <a href="https://doc.rust-lang.org/stable/book/ch15-04-rc.html"><code>Rc&lt;T&gt;</code>, the Reference Counted Smart Pointer</a></li>
<li>RPL 15.5: <a href="https://doc.rust-lang.org/stable/book/ch15-05-interior-mutability.html"><code>RefCell&lt;T&gt;</code> and the Interior Mutability Pattern</a></li>
<li>RPL 15.6: <a href="https://doc.rust-lang.org/stable/book/ch15-06-reference-cycles.html">Reference Cycles Can Leak Memory</a></li>
</ul>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-org2bb5b8e" class="outline-2">
<h2 id="org2bb5b8e">Week 6: Theory</h2>
<div class="outline-text-2" id="text-org2bb5b8e">
</div>
<div id="outline-container-org3a4a560" class="outline-3">
<h3 id="org3a4a560">Meeting 11</h3>
<div class="outline-text-3" id="text-org3a4a560">
</div>
<ul class="org-ul">
<li><a id="org8edd006"></a>Title: <b>Blocks and Lifetimes</b><br /></li>
<li><a id="orgacfacb1"></a>Reading:<br />
<div class="outline-text-4" id="text-orgacfacb1">
<ul class="org-ul">
<li>RPL 10.3: <a href="https://doc.rust-lang.org/book/ch10-03-lifetime-syntax.html">Validating References with Lifetimes</a></li>
<li>Rustonomicon:
<ul class="org-ul">
<li>3.2: <a href="https://doc.rust-lang.org/nomicon/aliasing.html">Aliasing</a></li>
<li>3.3: <a href="https://doc.rust-lang.org/nomicon/lifetimes.html">Lifetimes</a></li>
<li>3.4: <a href="https://doc.rust-lang.org/nomicon/lifetime-mismatch.html">Limits of Lifetimes</a></li>
<li>3.5: <a href="https://doc.rust-lang.org/nomicon/lifetime-elision.html">Lifetime Elision</a></li>
</ul></li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-org355b881" class="outline-3">
<h3 id="org355b881">Meeting 12</h3>
<div class="outline-text-3" id="text-org355b881">
</div>
<ul class="org-ul">
<li><a id="org365e1f1"></a>Title: <b>Tuples and Paths</b><br /></li>
</ul>
</div>
</div>
<div id="outline-container-org30ef1ab" class="outline-2">
<h2 id="org30ef1ab">Week 7: Concurrency</h2>
<div class="outline-text-2" id="text-org30ef1ab">
</div>
<div id="outline-container-orgeb9cfec" class="outline-3">
<h3 id="orgeb9cfec">Meeting 13</h3>
<div class="outline-text-3" id="text-orgeb9cfec">
</div>
<ul class="org-ul">
<li><a id="org07b2468"></a>Title: <b>Message Passing</b><br /></li>
</ul>
</div>
</div>
<div id="outline-container-org85ff0de" class="outline-2">
<h2 id="org85ff0de">Week 8: Midterm</h2>
<div class="outline-text-2" id="text-org85ff0de">
</div>
<div id="outline-container-org2db1dd8" class="outline-3">
<h3 id="org2db1dd8">Meeting 14</h3>
<div class="outline-text-3" id="text-org2db1dd8">
</div>
<ul class="org-ul">
<li><a id="org6875d30"></a>Title: <b>Asynchronous Programming</b><br /></li>
</ul>
</div>
<div id="outline-container-orgaa12159" class="outline-3">
<h3 id="orgaa12159">Meeting 15</h3>
<div class="outline-text-3" id="text-orgaa12159">
</div>
<ul class="org-ul">
<li><a id="org94b2c90"></a>Title: <b>Midterm Examination</b><br /></li>
</ul>
</div>
</div>
<div id="outline-container-org59f8112" class="outline-2">
<h2 id="org59f8112">Week 9: Theory</h2>
<div class="outline-text-2" id="text-org59f8112">
</div>
<div id="outline-container-orgf46c322" class="outline-3">
<h3 id="orgf46c322">Meeting 16</h3>
<div class="outline-text-3" id="text-orgf46c322">
</div>
<ul class="org-ul">
<li><a id="org37f7e37"></a>Title: <b>Conditionals</b><br /></li>
</ul>
</div>
<div id="outline-container-org8acd6f7" class="outline-3">
<h3 id="org8acd6f7">Meeting 17</h3>
<div class="outline-text-3" id="text-org8acd6f7">
</div>
<ul class="org-ul">
<li><a id="org6a77e24"></a>Title: <b>Linear Typed Lambda Calculus</b><br /></li>
</ul>
</div>
</div>
